Revit 2027 API
FilterCategoryRule Constructor
 Constructs a new instance of FilterCategoryRule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilterCategoryRule(
	ICollection<ElementId> categories
)
Public Sub New (
	categories As ICollection(Of ElementId)
)
public:
FilterCategoryRule(
	ICollection<ElementId^>^ categories
)
new :
        categories : ICollection<ElementId> -> FilterCategoryRule
Parameters
categories ICollection<ElementId>
 The set of categories.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterCategoryRule Class
Autodesk.Revit.DB Namespace